Aeronavics/ValleyForge/res/avr/freertos/atmega2560/port.c
/*
	FreeRTOS.org V4.8.0 - Copyright (C) 2003-2008 Richard Barry.

	This file is part of the FreeRTOS.org distribution.

	FreeRTOS.org is free software; you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation; either version 2 of the License, or
	(at your option) any later version.

	FreeRTOS.org is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.

	You should have received a copy of the GNU General Public License
	along with FreeRTOS.org; if not, write to the Free Software
	Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA

	A special exception to the GPL can be applied should you wish to distribute
	a combined work that includes FreeRTOS.org, without being obliged to provide
	the source code for any proprietary components.  See the licensing section 
	of http://www.FreeRTOS.org for full details of how and when the exception
	can be applied.

	***************************************************************************
	***************************************************************************
    *                                                                         *
    * SAVE TIME AND MONEY!  We can port FreeRTOS.org to your own hardware,    *
    * and even write all or part of your application on your behalf.          *
    * See http://www.OpenRTOS.com for details of the services we provide to   *
    * expedite your project.                                                  *
    *                                                                         *
    ***************************************************************************
    ***************************************************************************

	Please ensure to read the configuration and relevant port sections of the
	online documentation.

	http://www.FreeRTOS.org - Documentation, latest information, license and 
	contact details.

	http://www.SafeRTOS.com - A version that is certified for use in safety 
	critical systems.

	http://www.OpenRTOS.com - Commercial support, development, porting, 
	licensing and training services.
*/

/* 

Changes from V2.6.0

	+ AVR port - Replaced the inb() and outb() functions with direct memory
	  access.  This allows the port to be built with the 20050414 build of
	  WinAVR.
*/

#include <stdlib.h>
#include <avr/interrupt.h>

#include "FreeRTOS.h"
#include "task.h"

/*-----------------------------------------------------------------------------
 * Implementation of functions defined in portable.h for the AVR port.
 *----------------------------------------------------------------------------*/

/* If we're using the Real Time Clock counter, check the processor for Timer 0
 * or Timer 2 usage
 */

#ifndef USE_RTC_TIMER
	#define USE_RTC_TIMER
#endif
#ifdef USE_RTC_TIMER
	#if defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
		#define __ATmegaxx0__
		#define TIMER_COMPARE_SIG	SIG_OUTPUT_COMPARE2A
	#else
		#define TIMER_COMPARE_SIG	SIG_OUTPUT_COMPARE0A
	#endif
#else
	#define TIMER_COMPARE_SIG	SIG_OUTPUT_COMPARE1A
#endif

/* Start tasks with interrupts enables. */
#define portFLAGS_INT_ENABLED					( ( portSTACK_TYPE ) 0x80 )

/* Hardware constants for timer 1. */
#define portCLEAR_COUNTER_ON_MATCH				( ( unsigned portCHAR ) (1 << WGM12) )
#define portPRESCALE_64							( ( unsigned portCHAR ) (1 << CS11) | (1 << CS10) )
#define portCLOCK_PRESCALER						( ( unsigned portLONG ) 64 )
#define portCOMPARE_MATCH_A_INTERRUPT_ENABLE	( ( unsigned portCHAR ) (1 << OCIE1A) )

#if defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
#  define TIMSK TIMSK1		// ATmega640/1280/2560 has more than one TIMSK register
#endif

/*-----------------------------------------------------------*/

/* We require the address of the pxCurrentTCB variable, but don't want to know
any details of its type. */
typedef void tskTCB;
extern volatile tskTCB * volatile pxCurrentTCB;

portTickType portTicksPerSecond;

/*-----------------------------------------------------------*/

/* 
 * Macro to save all the general purpose registers, the save the stack pointer
 * into the TCB.  
 * 
 * The first thing we do is save the flags then disable interrupts.  This is to 
 * guard our stack against having a context switch interrupt after we have already 
 * pushed the registers onto the stack - causing the 32 registers to be on the 
 * stack twice. 
 * 
 * r1 is set to zero as the compiler expects it to be thus, however some
 * of the math routines make use of R1. 
 * 
 * The interrupts will have been disabled during the call to portSAVE_CONTEXT()
 * so we need not worry about reading/writing to the stack pointer. 
 *
 * Note that for the ATmega256x we also need to store the RAMPZ and EIND registers.
 */
#if 0 // always_inline requires optimization of at least -O1
void portSAVE_CONTEXT( void )  __attribute__ ( ( naked, always_inline ) );
void portSAVE_CONTEXT( void )
{
	asm volatile (	"push	r0						\n\t"
					"in		r0, __SREG__			\n\t"
					"cli							\n\t"
					"push	r0						\n\t"
#if defined(__AVR_ATmega2560__) || defined(__AVR_ATmega2561__)
					"in		r0, 0x3b				\n\t"
					"push	r0						\n\t"
					"in		r0, 0x3c				\n\t"
					"push	r0						\n\t"
#endif
					"push	r1						\n\t"
					"clr	r1						\n\t"
					"push	r2						\n\t"
					"push	r3						\n\t"
					"push	r4						\n\t"
					"push	r5						\n\t"
					"push	r6						\n\t"
					"push	r7						\n\t"
					"push	r8						\n\t"
					"push	r9						\n\t"
					"push	r10						\n\t"
					"push	r11						\n\t"
					"push	r12						\n\t"
					"push	r13						\n\t"
					"push	r14						\n\t"
					"push	r15						\n\t"
					"push	r16						\n\t"
					"push	r17						\n\t"
					"push	r18						\n\t"
					"push	r19						\n\t"
					"push	r20						\n\t"
					"push	r21						\n\t"
					"push	r22						\n\t"
					"push	r23						\n\t"
					"push	r24						\n\t"
					"push	r25						\n\t"
					"push	r26						\n\t"
					"push	r27						\n\t"
					"push	r28						\n\t"
					"push	r29						\n\t"
					"push	r30						\n\t"
					"push	r31						\n\t"
					"lds	r26, pxCurrentTCB		\n\t"
					"lds	r27, pxCurrentTCB + 1	\n\t"
					"in		r0, 0x3d				\n\t"
					"st		x+, r0					\n\t"
					"in		r0, 0x3e				\n\t"
					"st		x+, r0					\n\t"
				);
}
#endif

