Aeronavics/ValleyForge/res/avr/freertos/atmega2560/port.c
void vPortEndScheduler( void )
{
	/* It is unlikely that the AVR port will get stopped.  If required simply
	disable the tick interrupt here. */
}
/*-----------------------------------------------------------*/

/*
 * Manual context switch.  The first thing we do is save the registers so we
 * can use a naked attribute.
 */
void vPortYield( void ) __attribute__ ( ( naked ) );
void vPortYield( void )
{
	portSAVE_CONTEXT();
	vTaskSwitchContext();
	portRESTORE_CONTEXT();

	asm volatile ( "ret" );
}
/*-----------------------------------------------------------*/

/*
 * Context switch function used by the tick.  This must be identical to 
 * vPortYield() from the call to vTaskSwitchContext() onwards.  The only
 * difference from vPortYield() is the tick count is incremented as the
 * call comes from the tick ISR.
 */
void vPortYieldFromTick( void ) __attribute__ ( ( naked ) );
void vPortYieldFromTick( void )
{
	portSAVE_CONTEXT();
	vTaskIncrementTick();
	vTaskSwitchContext();
	portRESTORE_CONTEXT();

	asm volatile ( "ret" );
}
/*-----------------------------------------------------------*/

void vPortSystemClockEnable( portBASE_TYPE Enable )
{
	portCHAR uc;

#ifndef USE_RTC_TIMER
	uc = TIMSK;
	if ( Enable )
	{
		uc |= portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
	}
	else
	{
		uc &= ~portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
	}
	TIMSK = uc;
#else

#ifdef __ATmegaxx0__
	uc = TIMSK2;
	if ( Enable )
	{
		uc |= (1 << OCIE2A);
	}
	else
	{
		uc &= ~(1 << OCIE2A);
	}
	TIMSK2 = uc;
#else
	uc = TIMSK;
	if ( Enable )
	{
		uc |= (1 << OCIE0);
	}
	else
	{
		uc &= ~(1 << OCIE0);
	}
	TIMSK = uc;
#endif // __ATmegaxx0__

#endif // USE_RTC_TIMER
}

/*-----------------------------------------------------------*/

#ifndef USE_RTC_TIMER
/*
 * Setup timer 1 compare match A to generate a tick interrupt.
 */
static void prvSetupTimerInterrupt( void )
{
unsigned portLONG ulCompareMatch;
unsigned portCHAR ucHighByte, ucLowByte;

	/* Set up system to enable yield on clock tick */
	portEnableYieldFromTick = pdTRUE;

	/* Using 16bit timer 1 to generate the tick.  Correct fuses must be
	selected for the configCPU_CLOCK_HZ clock. */

	ulCompareMatch = configCPU_CLOCK_HZ / configTICK_RATE_HZ;

	/* We only have 16 bits so have to scale to get our required tick rate. */
	ulCompareMatch /= portCLOCK_PRESCALER;

	/* Adjust for correct value. */
	ulCompareMatch -= ( unsigned portLONG ) 1;

	/* Setup compare match value for compare match A.  Interrupts are disabled 
	before this is called so we need not worry here. */
	ucLowByte = ( unsigned portCHAR ) ( ulCompareMatch & ( unsigned portLONG ) 0xff );
	ulCompareMatch >>= 8;
	ucHighByte = ( unsigned portCHAR ) ( ulCompareMatch & ( unsigned portLONG ) 0xff );
	OCR1AH = ucHighByte;
	OCR1AL = ucLowByte;

	/* Setup clock source and compare match behaviour. */
	ucLowByte = portCLEAR_COUNTER_ON_MATCH | portPRESCALE_64;
	TCCR1B = ucLowByte;

	/* Enable the interrupt - this is okay as interrupt are currently globally
	disabled. */
	ucLowByte = TIMSK;
	ucLowByte |= portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
	TIMSK = ucLowByte;
}

#else // use RTC timer
/*
 * Setup Crystal-controlled timer compare match A to generate a tick interrupt.
 */
static void prvSetupTimerInterrupt( void )
{
	unsigned portSHORT usCompareMatch;
	unsigned portCHAR i;

	/* Using 8bit timer 0 (or 2) to generate the tick.  A 32.768 KHz crystal
	 * must be attached to the appropriate pins.  We then adjust the number
	 * to a power of two so we can get EXACT seconds for the Real Time clock.
	 */

	usCompareMatch = ((unsigned long) 32768) / configTICK_RATE_HZ;

	if ( usCompareMatch > 192 )
	{
		usCompareMatch = 256;
	}
	else
	{
		for (i = 7; i >= 1; i--)
		{
			if ( usCompareMatch & ((unsigned short)1 << i) )
			{
				/* found the power - now let's see if we round up or down */
				if ( usCompareMatch & ((unsigned short)1 << (i-1)) )
				{
					usCompareMatch = ((unsigned short)1 << (i+1));
				}
				else
				{
					usCompareMatch = ((unsigned short)1 << i);
				}
				break;
			}
		}
	}

	portTicksPerSecond = ((unsigned long) 32768) / usCompareMatch;

	/* Adjust for correct value. */
	usCompareMatch -= ( unsigned portLONG ) 1;

#ifdef __ATmegaxx0__		
	/* ATmega640/1280/2560 uses Timer2 for the real time clock */
	TIMSK2 = 0;									// disable timer interrupts
	TIFR2 = 0x7;								// clear all pending interrupts

	ASSR = (1 << AS2);							// set timer to run from xtal
	TCNT2 = 0x00;								// clear the counter
	TCCR2A = (1 << WGM21);						// mode CTC (clear on counter match)
	TCCR2B = (1 << CS20);						// div. sys clock by 1
	OCR2A = usCompareMatch;

	while ( ASSR & 0x07 );						// wait for timer to be ready

	TIMSK2 |= (1 << OCIE2A);					// interrupt on timer2 compare match

#else					
	/* ATmega128 et. al. uses Timer0 for the real time clock */
	TIMSK &= ~( (1 << TOIE0) | (1 << OCIE0) );	// disable timer0 interrupts

	ASSR = (1 << AS0);							// set timer to run from xtal
	TCNT0 = 0x00;								// clear the counter
	TCCR0 = ( (1 << WGM01) | (1 << CS00);		// div. sys clock by 1
	OCR0 = usCompareMatch;

	while ( ASSR & 0x07 );						// wait for timer to be ready

	TIMSK |= (1 << OCIE0);						// interrupt on timer0 compare match

#endif
}

#endif // USE_RTC_TIMER

/*-----------------------------------------------------------*/

#if configUSE_PREEMPTION == 1

	/*
	 * Tick ISR for preemptive scheduler.  We can use a naked attribute as
	 * the context is saved at the start of vPortYieldFromTick().  The tick
	 * count is incremented after the context is saved.
	 */


	ISR( TIMER_COMPARE_SIG, ISR_NAKED ISR_SECTION )
	{
		vPortYieldFromTick();
		asm volatile ( "reti" );
	}
#else

	/*
	 * Tick ISR for the cooperative scheduler.  All this does is increment the
	 * tick count.  We don't need to switch context, this can only be done by
	 * manual calls to taskYIELD();
	 */
	ISR( TIMER_COMPARE_SIG, ISR_NAKED ISR_SECTION )
	{
		vTaskIncrementTick();
		asm volatile ( "reti" );
	}
#endif


